In [1]:
import pandas as pd
import numpy as np

In [2]:
age_combine = pd.DataFrame({'Class-1':[22,40],'Class-2':[24,50],'Class-3':[20,45]})
age_combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45

# Renaming columns

In [3]:
age_combine.rename(columns={'Class-1':'Batch-1','Class-2':'Batch-2','Class-3':'Batch-3'}, inplace=True)

In [4]:
age_combine

   Batch-1  Batch-2  Batch-3
0       22       24       20
1       40       50       45

# Renaming can also be done directly

In [5]:
age_combine.columns=["batch-1","batch2","batch3"]

In [6]:
age_combine

   batch-1  batch2  batch3
0       22      24      20
1       40      50      45

# Replacing values or observations

In [7]:
age_combine.replace({22:33})

   batch-1  batch2  batch3
0       33      24      20
1       40      50      45

In [8]:
age_combine

   batch-1  batch2  batch3
0       22      24      20
1       40      50      45

# Adding a new column
There are four ways to insert a new column in a DataFrame

With the indexing operator.

In [9]:
age_combine['Batch-4']=[18, 40]

In [10]:
age_combine

   batch-1  batch2  batch3  Batch-4
0       22      24      20       18
1       40      50      45       40

insert method

In [11]:
age_combine.insert(3,'Class-6',[18, 35])

In [12]:
age_combine

   batch-1  batch2  batch3  Class-6  Batch-4
0       22      24      20       18       18
1       40      50      45       35       40

loc indexer

In [13]:
age_combine.loc[:,'Batch-5'] = [20,40]
age_combine

   batch-1  batch2  batch3  Class-6  Batch-4  Batch-5
0       22      24      20       18       18       20
1       40      50      45       35       40       40

concat function

In [14]:
batch6=pd.Series([31,48])
age_combine = pd.concat([age_combine, batch6], axis=1)
age_combine

   batch-1  batch2  batch3  Class-6  Batch-4  Batch-5   0
0       22      24      20       18       18       20  31
1       40      50      45       35       40       40  48

# Inserting rows
There are two methods for adding rows in a DataFrame

In [15]:
age_combine = pd.DataFrame({'Class-1':[22,40],'Class-2':[24,50],'Class-3':[20,45]})
age_combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45

append method

In [16]:
#age_combine = age_combine.append({'Class 1':35,'Class 2':33,'Class 3':21},ignore_index=True)
age_combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45

pd.concat function

In [17]:
new_row = pd.DataFrame([{'Class-1':32, 'Class-2':37, 'Class-3':47}])
pd.concat([age_combine, new_row])

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45
0       32       37       47

In [18]:
age_combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45

# Deleting columns
Three methods can be used to delete a column from a DataFrame

del function

In [19]:
del age_combine['Class-3']
age_combine

   Class-1  Class-2
0       22       24
1       40       50

In [20]:
age_combine

   Class-1  Class-2
0       22       24
1       40       50

In [21]:
age_combine.pop('Class-2')
age_combine

   Class-1
0       22
1       40

In [22]:
age_combine = pd.DataFrame({'Class-1':[22,40],'Class-2':[24,50],'Class-3':[20,45]})

In [25]:
age_combine.drop(['Class-1'],axis=1, inplace=True)
#age_combine.drop(['Class-1'],axis=1)
age_combine

   Class-2  Class-3
0       24       20
1       50       45

# Deleting a row
There are two methods for removing rows from a DataFrame

In [ ]:
age_combine = pd.DataFrame({'Class-1':[22,40],'Class-2':[24,50],'Class-3':[20,45]})
new_row = pd.DataFrame([{'Class-1':23, 'Class-2':43, 'Class-3':45}])

In [29]:
pd.concat([age_combine, new_row])

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45
0       23       43       45

Boolean selection

In [31]:
age_combine[~(age_combine.values < 50)]

   Class-1  Class-2  Class-3
1       40       50       45

drop method

In [32]:
age_combine.drop(1)

   Class-1  Class-2  Class-3
0       22       24       20

In [34]:
age_combine

   Class-1  Class-2  Class-3
0       22       24       20
1       40       50       45